feat: 添加mermaid的支持
